[
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "this is not bad but not as good as i want",
		"review_title": "neutral review"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I have been using the Razer Viper V2 Pro as my main mouse since around the beginning of the year and have been very happy with it. I wanted to try the Deathadder V3 Pro as well, since I saw a lot of CSGO pros using it but I saw some negative reviews that were complaining about poor build quality, creaking, etc. so I decided to hold off. I eventually saw the wired version get released and I picked it up when on sale, as I heard the quality was better on these units. I can happily say that the quality control on my unit has been flawless. No rattles, squeaks, creaks, etc. Everything works great. The cable is good, not the best I've ever used but it isn't noticeably stiff either. The mouse feet are incredibly smooth and the optical switches feel nice, though not quite as crisp as my Viper V2 Pro. The only minor quibble I have with the mouse is that the scroll wheel is a bit mushy and vague between steps. Other than that, I love it and rotate between it and my trusty Viper V2 Pro depending on my mood.",
		"review_title": "Incredible mouse so far, Razer hits another home run"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "but irritates my carpel tunnel so???",
		"review_title": "good mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The coating is awesome, the side buttons are awesome, and it is super light for its size and supports 4k & 8k.1010.",
		"review_title": "Continues to carry the legendary name!"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "good mouse that is better quality than its wireless version",
		"review_title": "good mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "good mouse.",
		"review_title": "Good mouse."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Looks clean, feels right. I tried a fancier mouse, and could never get used to the feel. This mouse has everything I need, and performs admirably. If you want a mouse that responds well, with precision, and most importantly (to me) *feels* right. This is the one.",
		"review_title": "The perfect mouse for my hand"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Feels very responsive, paired it with the Razer bungee v3 and the cord does not even exist anymore. The stock feet are pretty bad though and feel scratchy. I swapped them with tiger ice V2 and now it feels perfect. Highly recommend.",
		"review_title": "Very good mouse, stock mouse feet are bad though."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Razer has struck gold with their new Deathadder v3 line. The wired is no exception. 8khz polling rate along with a very lightweight and well built frame. Shape and comfort is quite good. Highly recommended for any esports players and gamers that like light mice.",
		"review_title": "Current Best Value For The Money"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Nice big palm grip, no resting thumb button, easy to clean. Is very light and felt hollow when clicking but I've gotten used to that and I really like this mouse now. Kind of feels like it's not there. Really enjoying it.",
		"review_title": "Nice big palm grip"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The shape was great, loved the polling rate options however the clicks I wasn't a fan of I tried to get over it but it just wasn't for me, the clicks didn't feel spammable.",
		"review_title": "Loved everything but the clicks"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The mouse is amazing, super light and super responsive. My cursor had micro jumps and jidders with my previous mice, this mouse completely fixed that problem. This is one of the best mouses I have ever used and this is coming from an original g mx518 user from 2008. I don't know if its a bad habbit or a larger mouse but I have trouble hitting the very front side button. i use a light grasp instead of cupping the mouse. I use my fingers on the sides to assist my movement which puts the mouse away from my palm making the front button kinda far from reach. Other than that its perfect , it has no speed adjust buttons so I set the speed with cursor movement and it stays one speed.  Huge bonus no RGB..",
		"review_title": "Great mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I've tried the razer viper mini, viper ultimate and the gpro super light. I picked this one up to try out the 8000hz polling rate but it's was absolute garbage did not work on my pc. (Ryzen 7 3700x , rx 6700xt). My frames did not go pass 30 when moving the mouse at 8000hz.The mouse is really fat so, if you have small hands it's gonna force you to palm grip. aside from the polling rate everything else is pretty solid if you just use 1000hz polling rate. It's really light for its size.Note: I ended up replacing this mouse for the gpro superlight because I have small hands, palming for really long time started hurting my fingers.",
		"review_title": "Very light, but really big"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I've been going through a bit of a mouse identity crisis as of late. My old Razer Viper was suddenly causing my hands to cramp up and after trying out a logitech mouse that people swore up and down on only to be vastly disappointed, I was a bit wary of trying this mouse. I was drawn to it for the promise of an ergonomic shape and that is precisely what I got. The finish on this mouse feels addictive to the touch, the clicks are satisfying and crisp, and my hand falls naturally on this thing like no other mouse I've used before. And it's INCREDIBLY light. I was honestly shocked at how light this thing was, it glides around like no one's business. Highly, highly recommend this mouse to just about anyone, it's a home run for me.",
		"review_title": "Incredibly comfortable"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I came from viper mini and was not sure if I will like shape or not since its bigger, first few days with it was just getting used to and man no it feels amazing, even better than viper mini, it has a smooth coating but unlike what people think its actually good for sweating hands as it sticks when you are sweat and it doesnt feel slippery but if your hands is too dry it might feel slippery. Sensor no flaws, weight is amazing, and I honestly think its a better buy than v3 pro as for less than half of price you get something same sensor, lgihter weight, better coating (preference) and also 8khz but thats just a bonus not needed. if you can find it for less than 60 dollars thats a good sale.",
		"review_title": "Top tier Budget Ergo mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "On the outside, it's a pretty basic looking gaming mouse. No RGB to help cut down on weight (I'll get to the weight in a minute) all black and sleek. But once you start using this bad boy, it's a game changer. The super light weight cuts down on my mouse hand fatigue and I've noticed I'm a tad more accurate as I can move the mouse faster than my cheaper super heavy wal-mart brand mouse. The optical switches are very nice. No more getting angry at missing a click, or clicking too late when I have an enemy in my sights when I knew I clicked on time. I would have to warn people on the 8k hyper polling, unless you have an extremely high end processor, do not turn that function on as it can drastically drop your framerate.",
		"review_title": "Game changer (see what I did there?)"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "If you only care about pure gaming performance, you have about 3 choices when it comes to mice. I did a lot of research to find the best mice and this is one of them. Fits in my hand perfectly. Does not have any extra annoying buttons. No software required because all the important settings like DPI and polling rate can be changed by buttons underneath the mouse. It does not have RGB, which might upset some people, but I say grow up, you are no longer 12 yo to care about pwetty lights. The latency is minimal. MY ONLY COMPLAIN is that sometimes I feel like my right click is not being registered. I asked a few people with the same mouse and it seems to only be an issue with my device. It is not noticible enough for me to return and get a new one. It does no happen more than once a day. It might just be my hand gettign used to the sensitivity of the clicks but idk",
		"review_title": "One of the best gaming mices right now"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "This mouse brags about how light it is, but it's so light that it's almost an inconvenience. It's hard to keep the mouse still while you're standing and trying to click on something, almost have to sit down to rest your wrist on the table before being able to control this mouse. Removable weights would've been a nice inclusion.",
		"review_title": "Good accuracy, cheap feel."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "You can't go wrong with this mouse though I do prefer some RGB. This thing is so light its insane, almost doesn't even feel like your holding it in your hand. Its a purely gaming mouse with all the essentials you need though I do have the say that the click is a high pitch ping for those who care. It clicks kind of loud! I have a G502X Plus and it is a more muted metallic click and this one sounds louder by 2X, which to some may be no big deal but it is noticeable. I have a XLLarge hand and this does feel butter smooth on my palm, the way my palm rests on it is very cushy. Id say more comfy and more ergonomic than the G502X Plus.",
		"review_title": "It's so light and comfortable"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "No double-click issues so far, and the mouse is in perfect condition.",
		"review_title": "Six (6) months without issues"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Very high quality mouse that has definitely helped improve my experience and control in both everyday computer tasks and gaming. It is comfortable with a good design that doesn't give much resistance against the mouse pad and allows for more consistent and quick movements under good control. The other things I wish it had were an extra additional button or a less curvy button design for the side buttons.",
		"review_title": "Very good quality and efficient mouse for gaming and general tasks."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The V3 optical switches don't feel squishy, very satisfying to click. The LMB and RMB are no longer sprung by the plastic body which caused DA V2 LMBRMB to float over the switches, resulting in loose-feeling mouse buttonsSmooth soft touch plastic give",
		"review_title": "Lighter and snappier mouse than the DeathAdder V2"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Goods: lightweight, fits hand well, wired. Bad: in my opinion not as comfortable as the Basilisk v2. Battery is irrelevant, this version is wired.",
		"review_title": "Not a bad option"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "But not great either.Sensor is good, shape is okay, it doesn't feel very refined. Stock skates are good, switches - decent but not great, lightweight it's a decent ergo but still prefer my steelseries prime. Cable is fine but very kinked from shipping.",
		"review_title": "It's not bad"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Lightweight makes this mouse easier to control and less fatiguing to play with. It's great in single player and multiplayer games, it's much smoother than my last Deathadder v2 X mouse and more responsive. No tacky RGB and the Razer logo is embossed and stealthy. The new ergonomic design is also much more comfortable than the older model mice. It didn't come with any grip tape though, I double checked the packaging (which is nice packaging) and the material is very soft and smooth. The mouse wheel feels really nice to scroll and click plus the polling is noticeably smoother and more responsive, but I can't go above 2khz polling with my Ryzen 5 3600 CPU or it'll lag my games.Definitely feel like this mouse is great for my large hand and is (hopefully) the last mouse I'll want to buy until it wears out.",
		"review_title": "Lightweight, crisp clicks and 8khz polling"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Wow, they knocked it out of the park with this mouse!  If you have large hands, and use a palm grip, this mouse is a dream.  It is super light weight and uses the same exact coating as a GPX.The side buttons are large and have great clicks.  The normal clicks are fantastic.  The cable is a little thick but it's no big deal because it's super light and fits perfectly fine in my mouse bungee.  If I had to pick some issue with it, I'd say the mouse wheel is kind of loud but I love the way it feels scrolling it.All in all, you should get this mouse if you prefer larger ergos, and don't mind a cable.  It is well worth the price at $69.99 and if you're reading this in the future and it's on sale, than it's a no brainer!",
		"review_title": "Fantastic mouse for people with large hands"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I switched from a Razer DeathAdder Elite Gaming purchased 4 years ago that was acting up a little to the DeathAdder V3.Couple of reasons for my 4-star review (vs perfect score):- clicking makes a very clicky sound. My previous mouse was noticeably quieter- the cable is thicker than what i'm used toCharacteristics I like about this mouse:- it is very very light- no rgb. Took me a bit to get used to, but do we really need rgb on mice?? No.",
		"review_title": "Clicky and Light"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "It feels a bit cheaper I guess you would say compared to the V2.Performance seems fine.",
		"review_title": "I would not recommend the mouse."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Alright, so, it's not for me. It's less comfortable than all previous iterations of the DeathAdder mouse and that's the primary reason I'm giving 3 stars.How is it less comfortable?  It 'sits lower,' and is likely better for smaller hands. The lower right side of the mouse (birds-eye view) features are EXTREMELY PRONOUNCED downward slop that I find very uncomfortable. I have fairly average-sized adult male hands.What's good? Well, is light your thing? It's not really mine but this thing is LIGHT LIGHT. Almost certainly the lightest mouse you've ever used and it won't be close.What else? Polling rate. If you install the Bloatware (errr...software) you can adjust the polling rate up to 8k, which is about 4x faster than most other extremely high-end mice. What does that mean? It means two things--1. Your PC is receiving inputs about the mouse's location that much more frequently. 2. If you're on an older CPU (For example, my 4790--about 10 years old) you won't be able to use this feature at all while gaming because it's so CPU intensive it'll bottleneck and you'll go from faster framerates than your monitor supports to stuttering-unplayable (20fps or lower). Default is 1k so, if you want to get what you're paying for....install the bloatware.",
		"review_title": "A different form factor from previous DeathAdders"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Lightweight feel. Love that the DPI button is on the bottom. I had other gaming mouse with DPI next to the right click button, it was a pain toe #$@.",
		"review_title": "Razer DeathAdder v3 wired"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I bought this Razer DeathAdder to replace my previous Razer Viper which finally wore out after years of abuse.  I love the DeathAdder's straight-forward design, uncomplicated by a surfeit of buttons and unnecessary features.  I was looking for a minimalist but high-quality, highly accurate mouse.  (Sorry, but I'm not into gaming).  This model is just pure Razer responsiveness and functionality using the latest hardware optical sensor and switch technology.  It's a wired mouse that never needs new batteries or recharging.  I like the absence of a glowing green logo on this model — it's a more serious look that is compatible with business settings.  Compared with competing mice from Microsoft and LogiTech, the Razer mouse's design is more focused on functionality and durability, and a better value.Razer has optional driver software for gamers.  I recommend keeping things simple: ignorethe optional driver and use WIndows' built-in mouse driver — it works great with this mouse.",
		"review_title": "Quality Razer mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Same sensor, same optical switches, this is incredible value. The coating isn't as premium as the Pro wireless but I prefer this rubberized grip. If you don't absolutely need wireless, this 8k polling is buttery smooth and noticeably different than the 1k polling on the v3 Pro. Stock skates are great too.You basically trade wireless for way higher polling and a slightly less premium coating, to me this is the perfect way to allow DAVE into your life.",
		"review_title": "Fantastic budget DAV3 pro"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "These work perfectly well. I mean......why shouldn't they?",
		"review_title": "Works great"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The mouse worked well until it didn't, which was after a few days of use. Just went dead. I contacted Razer customer service who made me jump through hoops and asked a slew of questions, had me produce proof of purchase, serial number, etc. In the end, they told me to return it to Amazon instead. Products can sometimes be defective, but this customer service is outrageous. In contrast, Amazon agreed to replace it.",
		"review_title": "Lousy customer service"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "One of the best mice I've ever owned. Higher polling rate is not a gimmick, I have a 4k, 240hz monitor and the difference is very obvious. Especially on FPS games.",
		"review_title": "Smooth tracking, great product"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Full disclosure; I loved it so much, I returned this one and bought the wireless one. It's way way more pricey, but when I use my old mouse I don't know how I put up with it for so long. With that said, this wired version is a great alternative if you can't justify the wireless's price (and that's okay!). It really is that worth it.",
		"review_title": "I'm not a gamer, but I get why a gamer would like it."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Great value mouse hasn't given me any problems. It feels nice in the hand. Really light.",
		"review_title": "Amazing"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The mouse is perfect in every way.-Super light-Premium quality-Coating is amazing-Best sensor-Clicks are smooth and fast (good with spam clicks)I have researched mice for a long time, and i am telling you this is the best one you'll find. I find it even better than the wireless version. 100% recommended.",
		"review_title": "The best wired gaming mouse ever"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I had the same problem on the model D. The back is too flat and pinches my palm when pulling back. Real shame as this is pretty solid otherwise.It could also use a different finish. It's all plastic, no soft areas on the top.",
		"review_title": "Pinches my hand"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I have big hands and this mouse fits the palm grip perfectly for me.The 8khz sensor has literally the lowest response time of any mouse sensor on the market, you literally cannot buy a better performing mouse than this one.",
		"review_title": "Best mouse on the market, especially for big hands"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "High quality but price too high for 20 year old design but 8k polling is big difference but causes lag. 84k will lag when moving mouse.  Have to play at 2k max. without causing jitter when moving mouse.  Feels cheap like a $15 mouse from 2004.",
		"review_title": "High quality  price too high for 20 yr old design. Alot of jitter anytime moving at 8k4k polling"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "One of the best mouse ever, the shape is amazing.??",
		"review_title": "For large hand, palm grip."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Fits nice in big hands and is a little long which does not bother me but something to consider and the side buttons are nice and tactile, as well as the main clicks. Only thing about it is the texture is a little smooth so grip tape may be another consideration but a solid mouse.",
		"review_title": "Great 'budget' option alternative to DaV3 Pro"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I really like this mouse. I had a death adder 2013, but hated when they changed to stick on sides. With them now gone, the mouse is perfect again.",
		"review_title": "What a Wonderful Mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "amazing mouse i got it because i play CSGO now everybody report me in the game XD",
		"review_title": "best mouse in the world"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Using this mouse, I can definitely feel the difference, before I was using a 2014 Naga, which is heavier than this mouse. This mouse is Light, meaning you can move it a lot faster, which means you can aim for headshots faster. I play OW and can definitely feel the difference.",
		"review_title": "I love This Mouse"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Great mouse for gaming- definitely worth it- big difference from an ordinary mouse..",
		"review_title": "Excellent for gaming!"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Its a better fit for right handed people who liked the razer viper. Its more responsive and a better fit for the hand.",
		"review_title": "Better than my razer viper."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "This is the first time I've bought a mouse that wasn't one of the super cheap sub-$10 mice. Finding it pretty awful. My biggest complaint is that the buttons have almost no resistance. I am constantly accidentally clicking (especially right-clicking) just resting my hand on the mouse. Also the first time I have used a mouse with the extra buttons under the thumb. I am constantly accidentally clicking those as well.Will be returning as soon as I have something else to use.",
		"review_title": "No button resistance"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Light, fast, and shaped perfectly.  You would think this version would have RGB but it doesn't.  I'm ok without that aspect.  Leaps and bounds above the normal death adder and the V2.",
		"review_title": "It's perfect."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I came from the razer viper ultimate WHITE CHROMA so the V2 verison. This mouse is leagues better, it's lighter, built better, no creeking, super fast, overall really good for ~60 USD",
		"review_title": "Better than the VIPER ULTIMATE"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Despite having 8khz support some games require a lower polling rate.  On My viper 8khz The lighting would alert me to the polling rate change. If I wanted to change the polling rate on the fly I would simply hit the profile switch key under the mouse.  On the Deathadder that is no longer possible without remapping a key i already use and I also lost the RGB which told me which profile I was using without having to alt tab.  I wanted the Deathadder shape on my 8khz mouse but this new version seemingly lost functionality.  Also loss of rubber side grip makes mouse much harder to hold than viper or previous Deathadders.",
		"review_title": "dpi button not programmable."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "The mouse was terrific, but the material had this weird hollow feel and the weight dispersal felt off. The Mouse feet (the bottom grips) don't glide well and produce too much friction.",
		"review_title": "its great but did not satisfy my gaming needs."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "very good, better than the wireless because better scroll wheel tension and actual grip coating",
		"review_title": "good"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I love everything about this mouse",
		"review_title": "This is the GOAT"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Pair this with a bungee and you don't have to worry about other wireless mouses. It's THAT GOOD.",
		"review_title": "Best wired mouse for $70"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Absolutely disgusted with Razer products and Razer support.I ordered this mouse by recommendation of a friend.Upon receiving the mouse, mouse button 4 felt 'less responsive' and sunken in upon first use.I didn't think much of it because it was my first Razer mouse.Fast forward 2 months later, the button sunk in fully. No drops, falls or damage.I contacted Razer, and waited 1 month without response. contacted again, they ensured I would get a response same day, and NO response.Contacted Razer a third time, and they requested I return the mouse before I get a replacement, or secondary option is TO PAY FOR A REPLACEMENT UNIT.I had an issue with a different mouse, and got a replacement within 2-3 days. without having the spend my own timemoney returning the old unit.I will never buy another Razer product again.If they had sent a new unit and created a shipping labelshipping box with that replacement it would have been much more satisfying.Do not buy razer products, their support is absolutely terrible. much like their products, AWFUL.",
		"review_title": "Mouse broke after 2 months."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "It is perfect with 8000hz polling rate.",
		"review_title": "Best responsive and accurate mouse in the world"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "can't go wrong with Razer",
		"review_title": "can't go wrong with Razer"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "All",
		"review_title": "Very good"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Feels soo cheap, i dont like the combo a light weight mouse should always feel expensive and good quality this just feels like a plastic mouse",
		"review_title": "Very cheap quality"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Good enough to switch from my g pro wireless. Clicks are super satisfying. As a first time Deathadder user: it feels like a g703 with a better shape and is superlight.",
		"review_title": "Personal New Favorite"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I never understood why Boardzy kept telling companies to use optical switches until now.  If they would all just feel like this, I'd have no problem, but unfortunately every other optical switch I've tried either feels too sharp, too mushy, or a little of both.  These however, feel better than most mechanicals I've used.Also this has one of the nicest rubberized coatings I've ever used in a mouse.  Once the viper v2 wired comes out, I'm instantly copping.",
		"review_title": "Finally, a good feeling optical switch!"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Failed in every aspect.  Non programmable, scrolling was incredibly slow, tracking was wack and software was bug and malware ladened.",
		"review_title": "Doesn't work"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I love this mouse and It has been my main mouse for 2 months now. I absolutely love the lightweight design and the ergonomic feel and shape of the mouse as well as the quality of the cable. However, I would highly recommend that you change the stock mouse feet. They are rough and scratchy, especially on glass pads. I changed the feet to superglides and my mouse pad is the vancer ice. It is very extreme with the speed and honesty feels like you are playing on a air hockey table at first. After I got used to it and the new mouse feet broke in it feels really good now, i'm able to flick faster than ever before and it feels just so much better. For some you could use the same combination of feet and pad with a wireless mouse and go even more crazy.In conclusion I love this mouse and it is worth every penny. I just don't like the stock feet that much.",
		"review_title": "Amazing but I would recommend you change the mouse feet."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Arrived dirty and opened box then glued all up I paid a lot for mouse doesnt work",
		"review_title": "Arrived very dirty and cut on box plugged inr doesn't work can't get help from Razer"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Dropped the mouse one time now the panel for the right side of the mouse just falls out and won't go back in properly. Just buy anything else.",
		"review_title": "Not “rage-proof”"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "*Pros.It's a mouse.*ConsToo expensiveMouse feels cheap.The twitches feel mushy.The left and right clicker feels different than the other.The DPI is at the bottom of the mouse. The V2 has it next to the mouse wheel.The wire is too short.Who uses 30k DPI? no point.",
		"review_title": "Cheap! Don't get it."
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Cursor freezes periodically while using the mouse. Spoke with several other people who have the same mouse and experienced the same problem. Firmware update and all other efforts I tried did nothing. Stay clear of this mouse!!",
		"review_title": "Trash software!"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Great mouse! very responsive, light, and comfortable.",
		"review_title": "Awesome"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "I AM LOVING THIS MOUSE SO GOOD!!!!!!!!",
		"review_title": "very goody"
	},
	{
		"name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Pro 30K Optical Sensor - Gen-3 Fast Optical Switches - 8K Hz HyperPolling - 6 Programmable Buttons - Ergonomic - Speedflex Cable - Black",
		"review_text": "Great in every aspects and WAY better deal and quality than the wireless version !!Unfortunately, it is too big for my liking",
		"review_title": "Excellent but not for me"
	}
]